Revit 2027 API
StairsRun.ExtensionBelowRiserBase Property
 Specifies a value to extend/trim the run's first step against base elevation of the stairs if the stairs begins with a riser.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ExtensionBelowRiserBase { get; set; }
Public Property ExtensionBelowRiserBase As Double
	Get
	Set
public:
property double ExtensionBelowRiserBase {
	double get ();
	void set (double value);
}
member ExtensionBelowRiserBase : float with get, set
Property Value
Double
 0.0 if the stairs run connects with stairs landing or the stairs run doesn't begin with a riser.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for extendBelowRiserBase must be no more than 30000 feet in absolute value. -or- When setting this property: The extendBelowRiserBase is not less than run height. -or- When setting this property: The extendBelowRiserBase is greater than the top elevation of the stairs run.
InvalidOperationException |  When setting this property: The run cannot extend its below base because its base joins with other stairs components. -or- When setting this property: The run cannot extend its below riser base because it doesn't begin with a riser.
Remarks
 This is useful in cases where the run attaches to the face of a floor opening rather than resting on the surface of the floor. Negative value extends the run's first step below the stairs' base elevation. Positive value trims it above the stairs' base elevation. This value should not be greater than run's top elevation.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace